In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import warnings 

warnings.filterwarnings('ignore')

In [50]:
train_data = pd.read_csv('train (2).csv')
test_data = pd.read_csv('test (2).csv')

In [51]:
train_data_original = train_data.copy()
test_data_original = test_data.copy()

### Data Exploration

In [52]:
train_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [53]:
train_data.shape

(891, 12)

In [54]:
test_data.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [55]:
test_data.shape

(418, 11)

In [56]:
train_data.describe().round(2)

       PassengerId  Survived  Pclass     Age   SibSp   Parch    Fare
count       891.00    891.00  891.00  714.00  891.00  891.00  891.00
mean        446.00      0.38    2.31   29.70    0.52    0.38   32.20
std         257.35      0.49    0.84   14.53    1.10    0.81   49.69
min           1.00      0.00    1.00    0.42    0.00    0.00    0.00
25%         223.50      0.00    2.00   20.12    0.00    0.00    7.91
50%         446.00      0.00    3.00   28.00    0.00    0.00   14.45
75%         668.50      1.00    3.00   38.00    1.00    0.00   31.00
max         891.00      1.00    3.00   80.00    8.00    6.00  512.33

In [57]:
test_data.describe().round(2)

       PassengerId  Pclass     Age   SibSp   Parch    Fare
count       418.00  418.00  332.00  418.00  418.00  417.00
mean       1100.50    2.27   30.27    0.45    0.39   35.63
std         120.81    0.84   14.18    0.90    0.98   55.91
min         892.00    1.00    0.17    0.00    0.00    0.00
25%         996.25    1.00   21.00    0.00    0.00    7.90
50%        1100.50    3.00   27.00    0.00    0.00   14.45
75%        1204.75    3.00   39.00    1.00    0.00   31.50
max        1309.00    3.00   76.00    8.00    9.00  512.33

In [58]:
train_data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [59]:
train_data.drop('Cabin', 1, inplace=True)
train_data.fillna(method='ffill', inplace=True)
train_data.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [60]:
test_data.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [61]:
test_data.drop('Cabin', 1, inplace=True)
test_data.fillna(method='ffill', inplace=True)
test_data.isna().sum()

PassengerId    0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [62]:
train_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Embarked     891 non-null    object
dtypes: float64(2), int64(5), object(4)
memory usage: 76.7+ KB

In [63]:
train_data.Survived.value_counts(normalize=True)

0    0.616162
1    0.383838
Name: Survived, dtype: float64

In [64]:

X = train_data.drop(['PassengerId','Survived','Name','Ticket' ],axis=1)
y = train_data['Survived']
test_data = test_data.drop(['PassengerId','Name', 'Ticket'],axis=1)

from sklearn.model_selection import train_test_split

In [65]:
X = pd.get_dummies(X)
train_data = pd.get_dummies(train_data)
test_data = pd.get_dummies(test_data)

In [66]:
X.shape, test_data.shape

((891, 10), (418, 10))

In [69]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.30, random_state=1)

In [70]:
X_train.shape, X_test.shape, y_train.shape, y_test.shape

((623, 10), (268, 10), (623,), (268,))

In [129]:
from sklearn.linear_model import LogisticRegression
from sklearn.svm import SVC
import xgboost
from xgboost import XGBRFClassifier
from sklearn.ensemble import RandomForestClassifier, AdaBoostClassifier, GradientBoostingClassifier, ExtraTreesClassifier
from sklearn.metrics import confusion_matrix

In [130]:
XG_model=RandomForestClassifier().fit(X_train, y_train)
XG_model

RandomForestClassifier()

In [148]:
XG_model=RandomForestClassifier().fit(X_train, y_train)

print('Accuracy of training: {:.4f}'.format(XG_model.score(X_train,y_train)))
print('Accuracy of testing: {:.4f}'.format(XG_model.score(X_test,y_test)))

Accuracy of training: 0.9872
Accuracy of testing: 0.7799

In [149]:
prediction = XG_model.predict(X_test)

confusion_matrix(prediction, y_test)

array([[137,  43],
       [ 16,  72]], dtype=int64)

In [150]:
XG_model=RandomForestClassifier().fit(X, y)

print('Accuracy of whole train dataset: {:.4f}'.format(XG_model.score(X,y)))

Accuracy of whole train dataset: 0.9843

In [151]:
Survived = XG_model.predict(test_data)

In [152]:
test_data_original['Survived']= Survived

In [153]:
test_data_original.head(5)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,0
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,0
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,0
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,1
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,0

In [154]:
submission = test_data_original[['PassengerId', 'Survived']]
submission.head()

   PassengerId  Survived
0          892         0
1          893         0
2          894         0
3          895         1
4          896         0

In [156]:
submission.to_csv('submission3.csv', index=False)